_Rarzrabotki/Rarus/USO2/Catalogs/СМ_НормативныеСборники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_НормативныеСборники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измеритель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНормативнойРасценки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБруттоТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНеттоТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Определитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Определители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНормативногоСборника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ДатыБазисныхЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметноНормативнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыФормированияНормативов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеныНормативныхСборников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегиональнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрямыеЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяЗарплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭксплуатацияМашинИМеханизмов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВТомЧислеЗарплатаМашинистов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьМатериалов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратМатериалов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьОборудования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НакладныеРасходыСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СметнаяПрибыльСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗатратыТрудаРабочих</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РесурсыНормативныхСборников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРесурса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_ТипыМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СтатусыФормированияНормативов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СтатусыФормированияНормативов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_НормативныеСборники/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Если НЕ ЭтотОбъект.ЭтоГруппа тогда
		
		//	преобразованное значение кода нормативной расценки
		перемЗИВ_Код	= СМ_СметаВызовСервера.ПреобразоватьКодСправочника(ЭтотОбъект.КодНормативнойРасценки);
		
		//	проверим, смогли ли получить код
		Если Булево(перемЗИВ_Код) тогда
			//	отключим стандартное присвоение кода справочника
			СтандартнаяОбработка	= Ложь;
		 	//	установить новое значение кода
			ЭтотОбъект.Код			= перемЗИВ_Код;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.КодНормативнойРасценки) ИЛИ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;;
	КодНормативнойРасценки = "";
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	СМ_НормативныеСборники.КодНормативнойРасценки КАК КодНормативнойРасценки
	              |ИЗ
	              |	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	              |ГДЕ
	              |	СМ_НормативныеСборники.Родитель = &Группа
	              |	И СМ_НормативныеСборники.ЭтоГруппа = ЛОЖЬ
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	СМ_НормативныеСборники.Ссылка УБЫВ";
	Запрос.УстановитьПараметр("Группа",ЭтотОбъект.Родитель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДлинаКода = СтрДлина(СокрЛП(Выборка.КодНормативнойРасценки));
		сч = ДлинаКода;
		СтрокаКода = СокрЛП(Выборка.КодНормативнойРасценки);
		ЧисловаяЧасть = "";
		Пока сч>0 Цикл
			ПоследСимвол = Сред(СтрокаКода,сч,1);
			Если Найти("0123456789",ПоследСимвол)>0 Тогда
				ЧисловаяЧасть = Строка(ПоследСимвол)+ЧисловаяЧасть;
			Иначе
				Прервать;
			КонецЕсли;
			сч = сч - 1;
		КонецЦикла;
		Если ЗначениеЗаполнено(ЧисловаяЧасть) Тогда
			ДлинаЧисла = СтрДлина(ЧисловаяЧасть);
			Префикс = Лев(СокрЛП(Выборка.КодНормативнойРасценки),ДлинаКода-ДлинаЧисла);
			СтрокаЧисла = ЧисловаяЧасть;
			Нулики = "";
			сч=0;
			Пока сч<=ДлинаЧисла Цикл
				Символ = Сред(СтрокаЧисла,сч,1);
				Если Символ = "0" Тогда
					Нулики = Строка(Нулики)+Строка("0");
					СтрокаЧисла = Сред(СтрокаЧисла,2);
				Иначе
					Прервать;
				КонецЕсли;
				сч=сч+1
			КонецЦикла;
			ЧислоСледующее = Формат(Число(СтрокаЧисла)+1,"ЧГ=0");
			КодСлед = Строка(Нулики) + Строка(ЧислоСледующее); 
			Если ДлинаЧисла < СтрДлина(КодСлед) Тогда
				Если ЗначениеЗаполнено(Нулики) Тогда
					Если СтрДлина(Нулики)=1 Тогда
						КодСлед = ЧислоСледующее
					Иначе
						Нулики = Сред(Нулики,2);
						КодСлед = Строка(Нулики) + ЧислоСледующее
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			КодНормативнойРасценки = Строка(Префикс) + КодСлед;
		КонецЕсли;
	КонецЕсли;
	ЭтотОбъект.КодНормативнойРасценки = КодНормативнойРасценки;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СметноНормативнаяБаза) Тогда
		
		Если ЗначениеЗаполнено(Родитель) Тогда
			СМБ=Родитель.СметноНормативнаяБаза;
			Если  ЗначениеЗаполнено(СМБ) и СМБ<>СметноНормативнаяБаза Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сметно-нормативная база не соответствует сметно-нормативной базе родительской группы. Данные не будут записаны.");
				Отказ=Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если (Не Ссылка.Наименование = Наименование) И (Не ЗначениеЗаполнено(ДлинноеНаименование)) Тогда
		ДлинноеНаименование = Наименование;
	КонецЕсли;
	
	Если ЭтоГруппа И ЭтоНовый() Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	КодНормативнойРасценки 	= "";
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		Статус = Перечисления.СМ_СтатусыФормированияНормативов.ВРаботе;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
